Revit 2027 API
RebarConstraint.NumberOfTargets Property
 Identifies the number of references associated to the rebar handle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfTargets { get; }
Public ReadOnly Property NumberOfTargets As Integer
	Get
public:
property int NumberOfTargets {
	int get ();
}
member NumberOfTargets : int with get
Property Value
Int32
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace